Revit 2026 API

# WallTypeThermalProperties Property

---

The calculated and settable thermal properties of the WallType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ThermalProperties ThermalProperties { get; }
```
```vb
Public ReadOnly Property ThermalProperties As ThermalProperties
	Get
```
```cpp
public:
property ThermalProperties^ ThermalProperties {
	ThermalProperties^ get ();
}
```
```fsharp
member ThermalProperties : ThermalProperties with get
```

#### Property Value

ThermalProperties

Returns  if the wall has no thermal properties. Curtain walls and stacked walls do not store thermal properties.

#### Reference

WallType Class

Autodesk.Revit.DB Namespace